Управление_торговлей.ПБТ/src/DataProcessors/ПроведениеАктовОтбораИСозданиеАктовПриема/ПроведениеАктовОтбораИСозданиеАктовПриема.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроведениеАктовОтбораИСозданиеАктовПриема</name>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Акт</name>
      <type>
        <types>DocumentRef.АктОтбора</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>АктПриема</name>
      <type>
        <types>DocumentRef.АктПриемаОбразцов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Управление_торговлей.ПБТ/src/Documents/АктОтбора/АктОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктОтбора</name>
  <registerRecords>AccumulationRegister.ОтборОбразцов</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбразцов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйПровел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ППК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВИСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Образцы</name>
    <attributes>
      <name>ДатаИзготовления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗамеса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаОбОтбореАрбитражногоОбразца</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоступленияНаСклад</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.МаршрутныйЛист</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ВидыИсследований</name>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаОбразца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.ЛабораторныйОбразец</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбрать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧИсследований</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИныеПоказатели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/АктПриемаОбразцов/АктПриемаОбразцов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемаОбразцов</name>
  <basedOn>Document.АктОтбора</basedOn>
  <registerRecords>AccumulationRegister.ОтборОбразцов</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбразцов</registerRecords>
  <attributes>
    <name>ДатаНачалаИсследований</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.АктОтбора</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Образцы</name>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.АктОтбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ВидыИсследований</name>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаОбразца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.ЛабораторныйОбразец</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/DataProcessors/ПроведениеАктовОтбораИСозданиеАктовПриема/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.ТЧ.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктОтбВИ.Ссылка КАК Акт,
	|	АктПриемаОбразцов.Ссылка КАК АктПриема
	|ИЗ
	|	Документ.АктОтбора.ТЧ_ВидыИсследований КАК АктОтбВИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктПриемаОбразцов КАК АктПриемаОбразцов
	|		ПО АктОтбВИ.Ссылка = АктПриемаОбразцов.ДокументОснование
	|			И (АктПриемаОбразцов.Лаборатория = &Лаборатория)
	|ГДЕ
	|	АктОтбВИ.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И АктОтбВИ.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НЕ АктОтбВИ.Ссылка.Проведен
	|	И АктОтбВИ.Ссылка.Пользователь В(&Пользователь)
	|	И АктОтбВИ.Лаборатория = &Лаборатория
	|
	|СГРУППИРОВАТЬ ПО
	|	АктПриемаОбразцов.Ссылка,
	|	АктОтбВИ.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктОтбВИ.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("КонПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Лаборатория", Лаборатория);
	Если СЗПользователи.Количество()>0 Тогда  //
		Запрос.УстановитьПараметр("Пользователь", СЗПользователи);
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И АктОтбВИ.Ссылка.Пользователь В(&Пользователь)", "");
	КонецЕсли; 
	Если ИПроведенные Тогда
	    Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ АктОтбВИ.Ссылка.Проведен", "");
	КонецЕсли; 
	Результат = Запрос.Выполнить();
	
	ВыборкаДетали = Результат.Выбрать();
	
	Пока ВыборкаДетали.Следующий() Цикл
		НовСтр = Объект.ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетали);
		НовСтр.Проводить = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровестиНаСервере()
	
	Для каждого СтрТЧ Из Объект.ТЧ Цикл
		
		Если Не СтрТЧ.Проводить Тогда
			Продолжить;
		КонецЕсли; 
		
		ДокОб = СтрТЧ.Акт.ПолучитьОбъект();
		
		//устанавливаем некоторые реквизиты документа
		Попытка 
			Если Не ЗначениеЗаполнено(ДокОб.ПервыйПровел) Тогда
				ДокОб.ПервыйПровел = Пользователи.ТекущийПользователь();
				ДокОб.Дата = ТекущаяДатаСеанса();
			КонецЕсли;
			ДокОб.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Записан документ "+ДокОб);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При записи документа "+ДокОб);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;		
	    //проводим документ
		Попытка 
			ДокОб.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведен документ "+ДокОб);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При проведении документа "+ДокОб);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	ПровестиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьВсеНаСервере()
	
	Для каждого Стр Из Объект.ТЧ Цикл
		Стр.Проводить = НЕ Стр.Проводить;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсе(Команда)
	ИзменитьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьАктыПриемаНаСервере()
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	//СпрЛаб = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяЛаборатория");
	//Если Не ЗначениеЗаполнено(СпрЛаб) Тогда
	//	СпрЛаб = Справочники.лаб_Лаборатории.НайтиПоКоду("3");//Лаборатория;
	//КонецЕсли; 
		
	Для каждого СтрТЧ Из Объект.ТЧ Цикл
		
		Если ЗначениеЗаполнено(СтрТЧ.АктПриема) Тогда
			Продолжить;
		КонецЕсли; 
		Если Не СтрТЧ.Проводить Тогда
			Продолжить;
		КонецЕсли; 
		
		АктПриема = Документы.АктПриемаОбразцов.СоздатьДокумент();
		
		АктПриема.Лаборатория = Лаборатория;
		АктПриема.Пользователь = ТекПользователь;
		АктПриема.Дата = ТекущаяДатаСеанса();
		
		АктПриема.Заполнить(СтрТЧ.Акт);
		
		Попытка
			АктПриема.Записать();
			СтрТЧ.АктПриема = АктПриема.Ссылка;
		Исключение
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("не удалось записать акт приема для "+ СтрТЧ.Акт);
		КонецПопытки; 
		Попытка
		    АктПриема.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("не удалось провести акт приема для "+ СтрТЧ.Акт);
		КонецПопытки;		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАктыПриема(Команда)
	СоздатьАктыПриемаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.ДатаНачала = ТекущаяДата();
	Период.ДатаОкончания = ТекущаяДата();
КонецПроцедуры
